/*
Класс рёбер.

---------------------------------------------------------------------
Пример работы.
    Для вершины "A" в массиве vertexMas["A", "B", "C", null...],
    В adjacentMas есть место для массива всех его рёбер:
        [ [для вершины A] , []...]
    Это выглядит так:
        [ [(B, 3), (C, 1)] , []...]
    (Есть ребро A-B с весом = 3, и ребро A-C с весом = 1).
---------------------------------------------------------------------
 */

public class Edge<V> {
    V to;
    int weight; // void addEdge(V from, V to, int weight), как в условии: "to", "weight".

    public Edge(V to, int weight) {
        this.to = to;
        this.weight = weight;
    }
}
